Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkTagsAttributes Class
 The SectionMarkTagsAttributes class contains attributes for section mark tags.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SectionMarkTagsAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class SectionMarkTagsAttributes
	Inherits GenericAttributesBase
The SectionMarkBase.SectionMarkTagsAttributes type exposes the following members.
Constructors
Name | Description
SectionMarkBase.SectionMarkTagsAttributes()
 Creates a new mark tags attributes instance.
SectionMarkBase.SectionMarkTagsAttributes(SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes)
 Creates a new mark tags attributes instance.
Top
Properties
Name | Description
TagA1
 The tag A1 of a mark.
TagA2
 The tag A2 of a mark.
TagA3
 The tag A3 of a mark.
TagA4
 The tag A4 of a mark.
TagA5
 The tag A5 of a mark.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace